[
  {
    "image": "https://logos-world.net/wp-content/uploads/2020/05/Logo-WhatsApp.png",
    "title": "Chat Master",
    "companyName": "Nova Tech",
    "id": 1,
    "description": "This lightning-fast messaging app redefines secure communication for today's always-connected world. Beyond basic texting, it creates a seamless ecosystem with end-to-end encryption, smart reply suggestions, and disappearing messages to keep conversations private and clutter-free. Users can organize chats with custom folders, set priority notifications, and enjoy rich media sharing with high-quality compression. The clean, intuitive interface minimizes distractions so you stay present in every conversation. Gentle reminders help manage group chats and unread messages without overwhelming you. A standout feature is AI-powered conversation summaries that recap long threads instantly, perfect for busy professionals or families. Built-in voice and video calls with low-data modes ensure crystal-clear connections anywhere. Whether catching up with friends, coordinating work teams, or sharing moments securely, Chat Master turns messaging into a productive, enjoyable experience that respects your time and privacy.",
    "size": 45,
    "reviews": 12450,
    "ratingAvg": 4.6,
    "downloads": 500000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 750 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 5000 }
    ]
  },
  {
    "image": "https://static0.anpoimages.com/wordpress/wp-content/uploads/2020/07/10/google-fit-hero.png",
    "title": "Fit Life",
    "companyName": "Healthify",
    "id": 2,
    "description": "This all-in-one fitness companion transforms daily health tracking into an effortless habit for busy modern lives. Instead of scattered logs, it builds a personalized ecosystem around workouts, nutrition, and wellness goals with automatic activity detection and smart insights. Users set custom challenges, log meals with barcode scanning, and monitor heart rate, sleep, and steps in one unified dashboard. The motivational interface uses progress rings and streaks to celebrate consistency without pressure. Gentle nudges remind you to move after long sits or hydrate throughout the day. A key highlight is integrated goal-based coaching that analyzes patterns and suggests adjustments—like shorter intense sessions for high-stress days. Detailed reports reveal trends in energy levels and recovery, helping refine routines for sustainable results. Whether you're hitting the gym, walking the dog, or aiming for better sleep, Fit Life acts as your personal health coach, making fitness feel achievable, rewarding, and integrated into everyday life.",
    "size": 60,
    "reviews": 9800,
    "ratingAvg": 4.4,
    "downloads": 750000,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 3200 },
      { "name": "5 star", "count": 3300 }
    ]
  },
  {
    "image": "https://androidcommunity.com/wp-content/uploads/2020/03/snapseed-dark-hero.jpg",
    "title": "PhotoSpark",
    "companyName": "Pixel Labs",
    "id": 3,
    "description": "This AI-driven photo editor elevates everyday snapshots into professional masterpieces with effortless creativity. Beyond basic filters, it crafts a complete editing suite that understands your style—offering intelligent auto-enhancements, selective adjustments, and generative tools for removing objects or expanding scenes. Users apply custom looks, heal imperfections seamlessly, and experiment with dramatic effects like portrait lighting or sky replacement. The minimalist workspace keeps focus on your image, with non-destructive edits and one-tap previews. Subtle tutorials guide beginners while pros unlock advanced curves and layers. A unique strength is the AI mood matcher that suggests edits based on scene emotion, plus batch processing for consistent series. Share-ready exports preserve quality across platforms. For social creators, hobby photographers, or anyone wanting standout visuals without complexity, PhotoSpark turns photo editing into an inspiring, intuitive flow that sparks joy in every capture.",
    "size": 85,
    "reviews": 15400,
    "ratingAvg": 4.7,
    "downloads": 1200000,
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 2100 },
      { "name": "4 star", "count": 5300 },
      { "name": "5 star", "count": 7000 }
    ]
  },
  {
    "image": "https://cdn-1.webcatalog.io/catalog/todoist/todoist-social-preview.png?v=1766968663882",
    "title": "TaskFlow",
    "companyName": "WorkSmart Inc",
    "id": 4,
    "description": "This smart productivity app turns chaotic to-do lists into streamlined workflows that actually get things done. It builds a distraction-free environment around task management with natural language input, priority levels, and recurring reminders. Users create projects, set deadlines, and break big goals into actionable steps while tracking progress visually. The calming design reduces overwhelm with clean lists and subtle color-coding. Daily reviews highlight what matters most, and gentle notifications keep momentum without nagging. A standout feature integrates subtasks with time estimates, showing realistic daily loads and suggesting optimal scheduling. Built-in labels and filters make organization effortless, plus collaboration tools for shared projects. Detailed insights reveal productivity patterns over weeks. Ideal for students, freelancers, or teams juggling multiple responsibilities, TaskFlow helps you work smarter by focusing energy where it counts, building habits of completion and calm efficiency day after day.",
    "size": 32,
    "reviews": 7600,
    "ratingAvg": 4.3,
    "downloads": 400000,
    "ratings": [
      { "name": "1 star", "count": 450 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1600 },
      { "name": "4 star", "count": 2600 },
      { "name": "5 star", "count": 2250 }
    ]
  },
  {
    "image": "https://www.freeiconspng.com/thumbs/spotify-icon/app-spotify-icon-13.png",
    "title": "Music Wave",
    "companyName": "SoundSphere",
    "id": 5,
    "description": "This premium music streaming app delivers an immersive audio experience tailored to your mood and moments. It goes beyond playlists by curating personalized discoveries, offline downloads in high fidelity, and seamless cross-device syncing. Users explore millions of tracks, create collaborative mixes, and dive into artist stories or live sessions. The elegant interface fades into the background, letting the music shine with dynamic visuals and lyrics sync. Smart recommendations evolve with your tastes, while equalizer tweaks and spatial audio enhance every listen. A key highlight is mood-based auto-playlists that adapt in real-time, plus podcast integration for seamless switches between music and talk. Daily mixes keep things fresh without effort. For commuters, workout enthusiasts, or late-night relaxers, Music Wave becomes your soundtrack curator—making every day more vibrant, focused, or serene through perfect sound.",
    "size": 90,
    "reviews": 22000,
    "ratingAvg": 4.8,
    "downloads": 3000000,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 2500 },
      { "name": "4 star", "count": 7500 },
      { "name": "5 star", "count": 11200 }
    ]
  },
  {
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202011/Screenshot_2020-11-05_at_5.14._1200x768.png?size=1200:675",
    "title": "QuickPay",
    "companyName": "FinTech Pro",
    "id": 6,
    "description": "This secure digital wallet redefines everyday payments with speed, simplicity, and peace of mind. It creates a complete financial hub for transfers, bill splitting, and contactless purchases while prioritizing ironclad security through biometrics and tokenization. Users scan QR codes for instant sends, schedule recurring payments, and track spending patterns effortlessly. The sleek design keeps transactions quick without clutter. Smart notifications alert for confirmations or unusual activity, helping maintain control. A unique integration with loyalty programs auto-applies rewards, plus split bills with friends via links. Detailed transaction history and category insights reveal habits for better budgeting. Whether shopping online, paying friends, or handling rent, QuickPay makes money movement feel effortless and trustworthy—empowering you to focus on life instead of logistics.",
    "size": 40,
    "reviews": 18000,
    "ratingAvg": 4.5,
    "downloads": 2000000,
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 7000 }
    ]
  },
  {
    "image": "https://blog.duolingo.com/content/images/2025/10/cover_explain-my-answer--1-.png",
    "title": "LearnNow",
    "companyName": "EduCore",
    "id": 7,
    "description": "This dynamic learning platform turns skill-building into an addictive, bite-sized adventure for lifelong growth. It combines expert-led courses with interactive quizzes, real-world projects, and progress tracking to make education engaging and effective. Users choose from thousands of topics—from coding to languages to creative skills—setting personalized paths with daily goals. The vibrant, gamified interface rewards consistency with streaks, badges, and leaderboards. Short, focused lessons fit busy schedules while deep dives satisfy curiosity. A standout feature is adaptive difficulty that adjusts to your pace, plus community discussions for motivation. Analytics show mastery levels and suggest next steps. For career switchers, students, or hobbyists, LearnNow becomes your dedicated learning companion—keeping you inspired, accountable, and progressing toward real expertise one rewarding session at a time.",
    "size": 70,
    "reviews": 13400,
    "ratingAvg": 4.6,
    "downloads": 950000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1900 },
      { "name": "4 star", "count": 4300 },
      { "name": "5 star", "count": 6000 }
    ]
  },
  {
    "image": "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/93/32/8f/93328f7a-28ca-b348-966a-5ec0af3b1ea7/AppIcon-0-0-1x_U007emarketing-0-11-0-85-220.png/400x400ia-75.webp",
    "title": "Travel Mate",
    "companyName": "WanderTech",
    "id": 8,
    "description": "This all-in-one travel companion simplifies planning and exploration for stress-free adventures anywhere. It builds a personalized itinerary hub with real-time flight/hotel bookings, offline maps, and insider recommendations tailored to your interests. Users save favorites, collaborate on group trips, and get smart suggestions for hidden gems or budget options. The intuitive interface organizes everything—from packing lists to currency converters—in one calm space. Gentle alerts notify of deals, delays, or nearby attractions. A key highlight is AI-powered route optimization that factors weather, traffic, and energy levels for smoother days. Post-trip journals and photo maps preserve memories beautifully. Whether weekend getaways, solo backpacking, or family vacations, Travel Mate turns travel into effortless joy—helping you focus on experiences while handling the details seamlessly.",
    "size": 55,
    "reviews": 8900,
    "ratingAvg": 4.2,
    "downloads": 600000,
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 2200 }
    ]
  },
  {
    "image": "https://download.logo.wine/logo/AccuWeather/AccuWeather-Logo.wine.png",
    "title": "Weather Plus",
    "companyName": "SkyNet Apps",
    "id": 9,
    "description": "This hyper-accurate weather app delivers precise forecasts and life-saving alerts to keep you prepared every day. It creates a smart environmental dashboard with minute-by-minute rain predictions, air quality insights, and severe weather radar. Users customize home screens for location-specific views, set hyper-local notifications, and track pollen or UV levels. The clean design prioritizes clarity with elegant visuals and easy toggles. Proactive alerts warn of sudden changes, helping plan commutes or outdoor activities. A unique feature integrates lifestyle tips—like outfit suggestions or allergy forecasts—plus hourly breakdowns for planning. Detailed historical data reveals patterns for better decision-making. For travelers, gardeners, or anyone weather-dependent, Weather Plus becomes your reliable daily advisor—ensuring you're always one step ahead of the elements with confidence and calm.",
    "size": 25,
    "reviews": 6700,
    "ratingAvg": 4.1,
    "downloads": 850000,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 1600 },
      { "name": "4 star", "count": 2100 },
      { "name": "5 star", "count": 1500 }
    ]
  },
  {
    "image": "https://www.pikpng.com/pngl/m/442-4423083_paths-to-literacy-google-keep-app-icon-clipart.png",
    "title": "Note Keeper",
    "companyName": "SimpleSoft",
    "id": 10,
    "description": "This effortless note-taking app captures ideas instantly and organizes thoughts without friction for clear-minded productivity. It builds a lightweight system for quick captures, checklists, drawings, and voice memos synced across devices. Users label notes, add reminders, and search everything with powerful text recognition. The minimalist interface keeps focus on content with color-coding and simple archiving. Gentle nudges surface important notes at the right time. A standout feature is smart categorization that auto-suggests labels and links related ideas. Rich formatting and image attachments make notes more expressive. For students jotting lecture points, professionals brainstorming, or anyone capturing life moments, Note Keeper becomes your reliable second brain—keeping thoughts accessible, organized, and ready whenever inspiration strikes.",
    "size": 20,
    "reviews": 5400,
    "ratingAvg": 4.0,
    "downloads": 300000,
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 1000 }
    ]
  },
  {
    "image": "https://static0.xdaimages.com/wordpress/wp-content/uploads/2021/03/Google-Play-Games.jpg?w=1200&h=675&fit=crop",
    "title": "Game Zone",
    "companyName": "PlayWorks",
    "id": 11,
    "description": "This vibrant game collection hub delivers endless fun with a curated library of addictive casual and arcade titles for any mood. It creates an engaging play space with daily challenges, leaderboards, and cross-game progress tracking. Users discover new favorites through smart recommendations, play offline modes, and compete with friends. The lively interface celebrates wins with animations and rewards. Gentle notifications highlight new releases or events without interrupting flow. A key highlight is cloud saves and achievements that unlock exclusive content across games. Variety spans puzzles, racing, strategy, and relaxing titles. For quick breaks, long sessions, or family fun, Game Zone turns downtime into joyful escapism—keeping entertainment fresh, social, and perfectly paced for real life.",
    "size": 120,
    "reviews": 30500,
    "ratingAvg": 4.7,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 9500 },
      { "name": "5 star", "count": 15400 }
    ]
  },
  {
    "image": "https://image.pngaaa.com/264/3861264-middle.png",
    "title": "Budget Buddy",
    "companyName": "MoneyMind",
    "id": 12,
    "description": "This intuitive expense tracker empowers smarter money habits with effortless tracking and insightful guidance for financial freedom. It builds a clear picture of spending by auto-categorizing transactions, setting custom budgets, and forecasting balances. Users log cash spends quickly, split bills, and visualize trends with colorful charts. The straightforward design reduces stress with progress bars and alerts for overspending. Motivational milestones celebrate savings goals reached. A unique feature offers personalized tips based on patterns—like cutting subscriptions or meal prepping savings. Goal tracking for vacations or emergencies adds purpose. Detailed reports reveal leaks and opportunities. For young professionals, families, or anyone building wealth, Budget Buddy acts as your friendly financial coach—turning money management into a rewarding path toward security and confidence.",
    "size": 35,
    "reviews": 8200,
    "ratingAvg": 4.4,
    "downloads": 650000,
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 2800 },
      { "name": "5 star", "count": 2500 }
    ]
  },
  {
    "image": "https://1000logos.net/wp-content/uploads/2021/06/Zomato-Logo-2016.png",
    "title": "Foodie",
    "companyName": "TasteTech",
    "id": 13,
    "description": "This delicious discovery app combines recipe inspiration with seamless food ordering to satisfy cravings anytime. It creates a personalized culinary world with tailored suggestions, trending dishes, and step-by-step cooking guides. Users save favorites, plan weekly meals, and order from local spots with one tap. The appetizing interface showcases vibrant photos and reviews. Smart filters find options by diet, cuisine, or mood. A standout feature is AI meal planner that suggests balanced recipes from ingredients you have, plus nutritional insights. Quick reorders and group ordering make sharing easy. For home cooks, busy eaters, or explorers, Foodie turns food into joy—connecting you to flavors that delight, nourish, and bring people together effortlessly.",
    "size": 65,
    "reviews": 14500,
    "ratingAvg": 4.5,
    "downloads": 1100000,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 2300 },
      { "name": "4 star", "count": 4700 },
      { "name": "5 star", "count": 6000 }
    ]
  },
  {
    "image": "https://cdn.dribbble.com/userupload/11067172/file/original-6ea3de73b2666e131c2e9ca1d3e2810b.png",
    "title": "Drive Safe",
    "companyName": "AutoTech",
    "id": 14,
    "description": "This intelligent navigation assistant prioritizes safety and efficiency for stress-free driving every trip. It builds a reliable companion with real-time traffic, hazard alerts, and voice-guided routes that adapt instantly. Users save frequent destinations, avoid tolls, and get parking suggestions. The focused interface keeps eyes on the road with large readouts and minimal distractions. Proactive warnings for speed cameras, sharp turns, or drowsy driving patterns help stay alert. A key highlight is integrated safety scores that track habits and suggest improvements. Offline maps ensure reliability anywhere. For daily commuters, road trippers, or new drivers, Drive Safe becomes your trusted co-pilot—guiding you smoothly, securely, and calmly to every destination.",
    "size": 50,
    "reviews": 9100,
    "ratingAvg": 4.3,
    "downloads": 780000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 3200 },
      { "name": "5 star", "count": 2600 }
    ]
  },
  {
    "image": "https://blog.duolingo.com/content/images/2025/10/cover_explain-my-answer--1-.png",
    "title": "Language Pro",
    "companyName": "LinguaSoft",
    "id": 15,
    "description": "This immersive language learner makes mastering new tongues fun, effective, and perfectly paced for real progress. It combines interactive lessons, speech recognition, and story-based practice to build vocabulary, grammar, and confidence naturally. Users set daily goals, earn rewards for streaks, and compete on leaderboards. The engaging interface uses gamification to keep motivation high without feeling forced. Adaptive exercises adjust to your level, focusing on weak spots. A standout feature is conversational AI chats that simulate real dialogues for practical fluency. Cultural tips and pronunciation coaching add depth. Detailed progress tracking shows growth over time. For travelers, expats, or curious minds, Language Pro becomes your dedicated language coach—turning learning into an exciting journey toward effortless communication and cultural connection.",
    "size": 75,
    "reviews": 16800,
    "ratingAvg": 4.6,
    "downloads": 1300000,
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 2200 },
      { "name": "4 star", "count": 5200 },
      { "name": "5 star", "count": 8300 }
    ]
  },
  {
    "image": "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/33/4d/56/334d56dd-aba2-e85b-cb2d-a0bee8036e7d/AppIcon-0-0-1x_U007emarketing-0-0-0-8-0-0-sRGB-85-220.png/1200x630wa.png",
    "title": "News Flash",
    "companyName": "Daily Media",
    "id": 16,
    "description": "This streamlined news reader delivers the world's top stories tailored to your interests with minimal noise and maximum insight. It curates personalized feeds from trusted sources, summarizing articles for quick reads while offering deep dives when wanted. Users follow topics, save for later, and get balanced viewpoints. The clean design prioritizes readability with dark mode and offline access. Smart notifications highlight breaking developments without overload. A unique feature clusters related stories for context, helping understand bigger pictures. Daily digests keep you informed efficiently. For busy readers wanting substance without sensationalism, News Flash becomes your reliable window to the world—keeping you knowledgeable, thoughtful, and ahead of the curve effortlessly.",
    "size": 30,
    "reviews": 6200,
    "ratingAvg": 4.0,
    "downloads": 900000,
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 1700 },
      { "name": "4 star", "count": 1800 },
      { "name": "5 star", "count": 1000 }
    ]
  },
  {
    "image": "https://www.nicepng.com/png/detail/115-1153959_google-home-logo-google-home-app-icon.png",
    "title": "Smart Home",
    "companyName": "HomeSync",
    "id": 17,
    "description": "This unified smart home controller brings all your devices into one intuitive hub for effortless living. It creates seamless automation with routines, voice commands, and energy insights. Users group lights, thermostats, cameras, and appliances for one-tap scenes like 'Movie Night' or 'Good Morning'. The straightforward dashboard shows status at a glance with energy usage trends. Gentle alerts notify of open doors or unusual activity. A standout feature is adaptive learning that suggests optimizations—like auto-adjusting lights based on habits. Security integrations provide peace of mind with live views and history. For tech lovers or busy households, Smart Home turns complex setups into simple comfort—making your space responsive, efficient, and truly yours.",
    "size": 58,
    "reviews": 10400,
    "ratingAvg": 4.5,
    "downloads": 820000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2100 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3500 }
    ]
  },
  {
    "image": "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/fd/9c/10/fd9c10cf-d87a-b099-12d6-c8d2e8c4b0b8/AppIcon-0-0-1x_U007emarketing-0-7-0-85-220.png/1200x630wa.png",
    "title": "Scanner Plus",
    "companyName": "DocuTech",
    "id": 18,
    "description": "This powerful document scanner digitizes paperwork instantly for organized, paperless efficiency. It creates crisp scans with auto-edge detection, perspective correction, and color enhancement using your phone's camera. Users organize files into folders, add signatures, annotate, and export as PDF or images. The clean interface makes scanning quick with batch mode for multi-page docs. OCR extracts text for searchability and editing. A key highlight is cloud sync and sharing options for seamless collaboration or backups. Password protection adds security for sensitive files. For students, professionals, or anyone drowning in receipts and forms, Scanner Plus becomes your portable office—turning chaos into clarity and keeping important documents always accessible and secure.",
    "size": 42,
    "reviews": 7300,
    "ratingAvg": 4.2,
    "downloads": 540000,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 1700 },
      { "name": "4 star", "count": 2300 },
      { "name": "5 star", "count": 1800 }
    ]
  },
  {
    "image": "https://1000logos.net/wp-content/uploads/2024/08/Calm-Logo.png",
    "title": "Meditate Now",
    "companyName": "CalmMind",
    "id": 19,
    "description": "This soothing mindfulness app guides you to inner peace with expertly crafted sessions for any moment or mood. It builds a daily practice space with guided meditations, breathing exercises, sleep stories, and mindful movement. Users choose from short check-ins to deep dives, tracking progress and building streaks for motivation. The serene interface uses gentle sounds and visuals to ease you in. Personalized recommendations adapt to your goals—like stress relief or better focus. A standout feature is mood-based playlists with nature sounds or ambient music for custom calm. Progress insights reveal patterns in well-being. For beginners or seasoned practitioners, Meditate Now becomes your gentle companion—helping you pause, reset, and cultivate clarity, resilience, and tranquility amid life's demands.",
    "size": 48,
    "reviews": 12500,
    "ratingAvg": 4.7,
    "downloads": 1000000,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1600 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 5900 }
    ]
  },
  {
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/22259693/download.png?quality=90&strip=all&crop=10.625,0,78.75,100",
    "title": "Shop Easy",
    "companyName": "MarketHub",
    "id": 20,
    "description": "This effortless shopping app turns browsing and buying into a delightful, deal-filled experience with personalized discoveries. It creates a tailored marketplace with smart recommendations, flash sales, and one-tap checkout. Users track wishlists, compare prices across sellers, and get alerts for drops or restocks. The vibrant interface showcases products beautifully with reviews and AR try-ons. Secure payments and easy returns build trust. A unique feature is bundle suggestions and style matching for smarter purchases. Order tracking and review reminders make post-buy smooth. For fashion lovers, gadget hunters, or everyday essentials seekers, Shop Easy becomes your savvy shopping ally—saving time, money, and hassle while delivering joy in every find.",
    "size": 95,
    "reviews": 19800,
    "ratingAvg": 4.4,
    "downloads": 2500000,
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1300 },
      { "name": "3 star", "count": 3200 },
      { "name": "4 star", "count": 6400 },
      { "name": "5 star", "count": 8000 }
    ]
  }
]
